hand = {'l': ['q', 'w', 'e', 'r', 't', 
              'a', 's', 'd', 'f', 'g', 
              'z', 'x', 'c', 'v']}
pos = {'q':(0,0), 'w':(0,1), 'e':(0,2), 'r':(0,3), 't':(0,4), 'y':(0,5), 'u':(0,6), 'i':(0,7), 'o':(0,8), 'p':(0,9),
       'a':(1,0), 's':(1,1), 'd':(1,2), 'f':(1,3), 'g':(1,4), 'h':(1,5), 'j':(1,6), 'k':(1,7), 'l':(1,8), 
       'z':(2,0), 'x':(2,1), 'c':(2,2), 'v':(2,3), 'b':(2,4), 'n':(2,5), 'm':(2,6)}

l, r = input().split()
answer = 0 # 최소 시간
for ch in input():
    # 손가락 이동하는데 택시거리만큼 시간 걸림
    if ch in hand['l']: # 좌측 문자이면 왼손 이동
        x1, y1 = pos[l]
        x2, y2 = pos[ch]
        answer += abs(x1-x2) + abs(y1-y2)
        l = ch
    else: # 우측 문자이면 왼손 이동
        x1, y1 = pos[r]
        x2, y2 = pos[ch]
        answer += abs(x1-x2) + abs(y1-y2)
        r = ch
    answer += 1 # 누르는데 1만큼 시간 걸림
print(answer)